x=[1 2 3 4 5 6 7 8 9 10 11 12];
y=[1 2 3 1 12 1 1 1 15 13 3 18];
plot(x,y,'r')
text(2.5,2,'A')
text(1.5,12,'red is A')
hold on

x=[1 2 3 4 5 6 7 8 9 10 11 12];
y=[2 3 4 2 16 3 1 2 12 12 5 14];
plot(x,y,'k')
text(2.5,3.5,'B')
text(1.5,13,'black is B')
hold on

x=[1 2 3 4 5 6 7 8 9 10 11 12];
y=[1 5 5 2 8 1 1 2 10 18 2 12];
plot(x,y,'g')
text(2.5,5,'C')
text(1.5,14,'green is C')
hold on

x=[1 2 3 4 5 6 7 8 9 10 11 12];
y=[1 3 4 2 12 2 1 2 12 14 3 15];
plot(x,y,'k--')
text(1.5,10,'--单字平均')
hold on

set(gca,'XLim',[1 12]);%X轴的数据显示范围
set(gca,'XTick',[1:1:12]);%设置要显示坐标刻度
set(gca,'XTickLabel',["物","理","信","息","工","程","学","院","左","右","电","气"]);%给坐标加标签 

set(gca,'YLim',[1 20]);%X轴的数据显示范围
set(gca,'YTick',[0:1:20]);%设置要显示坐标刻度
set(gca,'YTickLabel',[0:1:20]);%给坐标加标签 